Revit 2024 API
OverrideGraphicSettings.ProjectionLineWeight Property
 The projection surface line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int ProjectionLineWeight { get; }
Visual Basic
Public ReadOnly Property ProjectionLineWeight As Integer
	Get
Visual C++
public:
property int ProjectionLineWeight {
	int get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace